README.md

# Table of Contents

1.  [IXA-Helper](#orgcd359ee)
2.  [Getting started](#getting-started)
3.  [Prerequisites](#prerequisites)
4.  [Installing](#installing)
    1.  [Install the vesrion of node being provided (see .nvmrc or .node-version)](#installing--version)
    2.  [Install Yarn](#installing-yarn)



<a id="orgcd359ee"></a>

# IXA-Helper

NOTE: This file is exported from README.org. Any modifications should also be reflected in that file.


<a id="getting-started"></a>

# Getting started

Following the instructions below to get a copy of this project and running on your local environment for development and testing purpose


<a id="prerequisites"></a>

# Prerequisites

You need:

-   Yarn
-   NodeJS v10.7(nvm/nodenv files provided in repo)


<a id="installing"></a>

# Installing


<a id="installing--version"></a>

## Install the vesrion of node being provided (see .nvmrc or .node-version)

    nvm use


<a id="installing-yarn"></a>

## Install Yarn

On MacOS you can run `=brew install yarn --ignore-dependencies=` to install Yarn, otherwise you can download an installer from [here](http://yarnpkg.com/en/docs/install).
Install dependencies

    yarn install

or

    yarn

